% 根据S-N曲线计算损伤度
% 自编函数
% 上一步骤：平均应力修正
% 下一步骤：这是最后一个步骤
%  D=damage(S,i)
%  S：应力范围
%  i ：S-N曲线索引
%  D：损伤度
%
% 算法：
% S-N:  logN=logK-mlogS
% N：构件在应力范围为S 时达到破坏时的最大循环次数
% K：S-N曲线参数
% m：曲线的反斜率（一般取3）
% S：应力范围
%
%          S-N曲线          K
%     1         B           5.8E12
%     2         C           3.464E12
%     3         D           1.52E12
%     4         E            1.026E12
%     5         F            6.319E11
%     6         F2          4.33E11
%     7         G           2.481E11
%     8         W          9.279E10

function D=damage(S,i)
K=[5.8E12,3.464E12,1.52E12,1.026E12,6.319E11,4.33E11,2.481E11,9.279E10];

Nmax=log10(K(i))-3*log10(S);
Nmax=10.^Nmax;

tem=1./Nmax;
D=sum(tem);
end

  